import { Box, Text } from "@chakra-ui/react";

const CaptionDetails = () => {
  return (
    <>
      <Box
        w="60%"
        bg="white"
        height="400px"
        borderRadius="xl"
        boxShadow="md"
        overflowY="auto"
        maxHeight="300px"
        p={4}
        sx={{
            position: 'relative',
            _after: {
              content: `""`,
              position: 'absolute',
              bottom: 0,
              left: 0,
              right: 0,
              height: '100px', // این ارتفاع را می‌توانید بر اساس نیاز خود تنظیم کنید
              backdropFilter: 'blur(10px)', // اینجا فیلتر تاری اعمال می‌شود
            },
          }}
      >
        توضیحات:
        <Text fontSize="sm">
          پاستا یکی از انواع غذاهای بسیار محبوب و پر طرفدار در سراسر جهان است که
          با دستورهای بسیار متنوعی تهیه می شود. این غذای خوشمزه مانند لازانیا
          اصالتی ایتالیایی دارد و به دلیل طعم خوبش در سراسر جهان به عنوان یک
          غذای بین المللی شناخته می شود. در این مطلب، دستور یکی از پر طرفدارترین
          پاستا ها که چیکن پاستا یا به زبان فارسی پاستای مرغ نام دارد را آماده
          کرده ایم، اگر غذاهای مثل لازانیا و ماکارونی را می پسندید توصیه می کنیم
          حتما پاستا را هم درست کنید، چون مطمئنا از این غذای خاص و خوشمزه هم
          خوشتان خواهد آمد، برای مشاهده آموزش آشپزی ایتالیایی کامل و مرحله به
          مرحله طرز تهیه پاستا در ادامه با سایت آموزشی و فرهنگی چی شی همراه
          باشید.
        </Text>
      </Box>
      <Box
        h="full"
        w="40%"
        bg="gray.100"
        borderRadius="xl"
        boxShadow="md"
        overflowY="auto"
        maxHeight="300px"
        p={4}
      >
        مواد اولیه:
        <Text fontSize="sm">
          پاستا ۴۰۰-۵۰۰ گرم قارچ ۲۰۰ گرم سینه مرغ ۱ عدد شیر ۱ فنجان سیر ۱ حبه آب
          مرغ ۱ لیوان پنیر پارمزان ¼ فنجان آرد سفید ۲ قاشق غذاخوری نمک و فلفل
          سیاه به اندازه کافی جعفری و روغن به اندازه کافی
        </Text>
      </Box>
    </>
  );
};

export default CaptionDetails;
